import {T_Specialization} from "src/modules/types.ts";

export const SpecializationMocks:T_Specialization[] = [
    {
        id: 1,
        name: "ИУ4",
        status: 1,
        image: "",
        description: "Кафедра ИУ4 'Проектирование и технология производства электронной аппаратуры' осуществляет обучение по направлению, сочетающему в себе решение задач в областях конструирования, технологии производства и сквозной цифровизации промышленности. Основное внимание уделяется проведению сквозного (комплексного) схемотехнического, конструкторского и технологического проектирования электронной аппаратуры при активном использовании автоматизированных средств.",
        price: 28654,
        budget_place: 66,
        budget_passing_score: 239,
        paid_place: 35
    },
    {
        id: 2,
        name: "ИУ5",
        status: 1,
        image: "",
        description: "Системы обработки данных – это комплекс взаимодействующих методов и средств сбора и обработки электронной информации, необходимых для управления объектами с помощью электронно-вычислительных машин (ЭВМ) и других средств информационной техники.",
        price: 329761,
        budget_place: 75,
        budget_passing_score: 296,
        paid_place: 81
    },
    {
        id: 3,
        name: "ИУ8",
        status: 1,
        image: "",
        description: "Информационная безопасность — практика предотвращения несанкционированного доступа, использования, раскрытия, искажения, изменения, исследования, записи или уничтожения информации.",
        price: 306347,
        budget_place: 59,
        budget_passing_score: 281,
        paid_place: 55
    },
    {
        id: 4,
        name: "РК9",
        status: 1,
        image: "",
        description: "Кафедра занимается спектром технологий, которые являются составными частями концепции «Индустрия 4.0». Решаются задачи разработки интегрированных систем компьютерной автоматизации производственных процессов на разных уровнях, от станков с ЧПУ до интеллектуальных систем управления производством.",
        price: 254823,
        budget_place: 48,
        budget_passing_score: 260,
        paid_place: 60
    }
]